In [570]:
import wooldridge as wd
import pandas as pd

In [571]:
pd.set_option("display.max_columns", None)

In [572]:
df = wd.data('jtrain')

In [584]:
df.head()

,fcode,year,employ,sales,avgsal,scrap,rework,tothrs,union,grant,d89,d88,totrain,hrsemp,lscrap,lemploy,lsales,lrework,lhrsemp,lscrap_1,grant_1,clscrap,cgrant,clemploy,clsales,lavgsal,clavgsal,cgrant_1,chrsemp,clhrsemp,firm_sub_1988,firm_sub_1989,firm_sub_not,grant_1988,grant_1989,grant_no
0,410032.0,1987,100.0,47000000.0,35000.0,NaN,NaN,12.0,0,0,0,0,100.0,12.000000,NaN,4.605170,17.665659,NaN,2.564949,NaN,0,NaN,0,NaN,NaN,10.463103,NaN,NaN,NaN,NaN,False,False,1,0,0,1
1,410032.0,1988,131.0,43000000.0,37000.0,NaN,NaN,8.0,0,0,0,1,50.0,3.053435,NaN,4.875197,17.576710,NaN,1.399565,NaN,0,NaN,0,0.270027,-0.088949,10.518673,0.055570,0.0,-8.946565,-1.165385,False,False,1,0,0,1
2,410032.0,1989,123.0,49000000.0,39000.0,NaN,NaN,8.0,0,0,1,0,50.0,3.252033,NaN,4.812184,17.707331,NaN,1.447397,NaN,0,NaN,0,-0.063013,0.130621,10.571317,0.052644,0.0,0.198597,0.047832,False,False,1,0,0,1
3,410440.0,1987,12.0,1560000.0,10500.0,NaN,NaN,12.0,0,0,0,0,12.0,12.000000,NaN,2.484907,14.260197,NaN,2.564949,NaN,0,NaN,0,NaN,NaN,9.259130,NaN,NaN,NaN,NaN,False,False,1,0,0,1
4,410440.0,1988,13.0,1970000.0,11000.0,NaN,NaN,12.0,0,0,0,1,13.0,12.000000,NaN,2.564949,14.493544,NaN,2.564949,NaN,0,NaN,0,0.080043,0.233347,9.305651,0.046520,0.0,0.000000,0.000000,False,False,1,0,0,1

In [574]:
df["firm_sub_1988"] = (df["year"] == 1988) & (df["grant"] == 1).astype(int)
df["firm_sub_1989"] = (df["year"] == 1989) & (df["grant"] == 1).astype(int)
df["firm_sub_not"] = (df["grant"] == 0).astype(int)

In [576]:
df.head()

,year,fcode,employ,sales,avgsal,scrap,rework,tothrs,union,grant,d89,d88,totrain,hrsemp,lscrap,lemploy,lsales,lrework,lhrsemp,lscrap_1,grant_1,clscrap,cgrant,clemploy,clsales,lavgsal,clavgsal,cgrant_1,chrsemp,clhrsemp,firm_sub_1988,firm_sub_1989,firm_sub_not
0,1987,410032.0,100.0,47000000.0,35000.0,NaN,NaN,12.0,0,0,0,0,100.0,12.000000,NaN,4.605170,17.665659,NaN,2.564949,NaN,0,NaN,0,NaN,NaN,10.463103,NaN,NaN,NaN,NaN,False,False,1
1,1988,410032.0,131.0,43000000.0,37000.0,NaN,NaN,8.0,0,0,0,1,50.0,3.053435,NaN,4.875197,17.576710,NaN,1.399565,NaN,0,NaN,0,0.270027,-0.088949,10.518673,0.055570,0.0,-8.946565,-1.165385,False,False,1
2,1989,410032.0,123.0,49000000.0,39000.0,NaN,NaN,8.0,0,0,1,0,50.0,3.252033,NaN,4.812184,17.707331,NaN,1.447397,NaN,0,NaN,0,-0.063013,0.130621,10.571317,0.052644,0.0,0.198597,0.047832,False,False,1
3,1987,410440.0,12.0,1560000.0,10500.0,NaN,NaN,12.0,0,0,0,0,12.0,12.000000,NaN,2.484907,14.260197,NaN,2.564949,NaN,0,NaN,0,NaN,NaN,9.259130,NaN,NaN,NaN,NaN,False,False,1
4,1988,410440.0,13.0,1970000.0,11000.0,NaN,NaN,12.0,0,0,0,1,13.0,12.000000,NaN,2.564949,14.493544,NaN,2.564949,NaN,0,NaN,0,0.080043,0.233347,9.305651,0.046520,0.0,0.000000,0.000000,False,False,1

In [577]:
df = pd.concat([df.set_index("fcode"), df.groupby(["fcode"])["firm_sub_1988"].max().astype(int).rename("grant_1988")], axis=1).reset_index()
df = pd.concat([df.set_index("fcode"), df.groupby(["fcode"])["firm_sub_1989"].max().astype(int).rename("grant_1989")], axis=1).reset_index()
df = pd.concat([df.set_index("fcode"), (df.groupby(["fcode"])["firm_sub_not"].sum() == 3).astype(int).astype(int).rename("grant_no")], axis=1).reset_index()

In [580]:
df88 = df.groupby(["year", "grant_1988"]).agg({"fcode": "count", "hrsemp": ["mean", "std"]}).reset_index(level=1)
df88 = df88.loc[df88.grant_1988 == 1].drop(["grant_1988"], level=0, axis=1).reset_index()
df88.columns = ["year", "count", "mean", "std"]
df88["descricao"] = "Firmas que receberam subsídio em 1988"
df88 = df88.groupby(["descricao", "year"]).mean()
df88

                                            count       mean        std
descricao                             year
Firmas que receberam subsídio em 1988 1987     36   7.672105  19.574833
                                      1988     36  35.978342  36.956019
                                      1989     36  10.055916  19.474582

In [581]:
df89 = df.groupby(["year", "grant_1989"]).agg({"fcode": "count", "hrsemp": ["mean", "std"]}).reset_index(level=1)
df89 = df89.loc[df89.grant_1989 == 1].drop(["grant_1989"], level=0, axis=1).reset_index()
df89.columns = ["year", "count", "mean", "std"]
df89["descricao"] = "Firmas que receberam subsídio em 1989"
df89 = df89.groupby(["descricao", "year"]).mean()
df89

                                            count       mean        std
descricao                             year
Firmas que receberam subsídio em 1989 1987     30   6.124542  11.309335
                                      1988     30   9.315550  17.360545
                                      1989     30  50.649975  36.217713

In [582]:
dfnot = df.groupby(["year", "grant_no"]).agg({"fcode": "count", "hrsemp": ["mean", "std"]}).reset_index(level=1)
dfnot = dfnot.loc[dfnot.grant_no == 1].drop(["grant_no"], level=0, axis=1).reset_index()
dfnot.columns = ["year", "count", "mean", "std"]
dfnot["descricao"] = "Firmas que não receberam subsídio"
dfnot = dfnot.groupby(["descricao", "year"]).mean()
dfnot

                                        count       mean        std
descricao                         year
Firmas que não receberam subsídio 1987     91  10.702936  18.314595
                                  1988     91   9.817479  18.627084
                                  1989     91  12.352485  23.777301

In [583]:
df2 = pd.concat([df88, df89, dfnot])
df2

                                            count       mean        std
descricao                             year
Firmas que receberam subsídio em 1988 1987     36   7.672105  19.574833
                                      1988     36  35.978342  36.956019
                                      1989     36  10.055916  19.474582
Firmas que receberam subsídio em 1989 1987     30   6.124542  11.309335
                                      1988     30   9.315550  17.360545
                                      1989     30  50.649975  36.217713
Firmas que não receberam subsídio     1987     91  10.702936  18.314595
                                      1988     91   9.817479  18.627084
                                      1989     91  12.352485  23.777301